// *++
//
// Copyright (c) 2004 - 2009, Intel Corporation. All rights reserved.<BR>
// This program and the accompanying materials
// are licensed and made available under the terms and conditions of the BSD License
// which accompanies this distribution.  The full text of the license may be found at
// http://opensource.org/licenses/bsd-license.php
//
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
// Module Name:
//
//   SetupBrowserStr.uni
//
// Abstract:
//
//   String definitions for Browser.
//
// --*/


/=#

#langdef en-US "English"
#langdef fr-FR "Français"

#string FUNCTION_NINE_STRING           #language en-US  "F9=Reset to Defaults"
                                       #language fr-FR  "F9=Reset à Défauts"
#string FUNCTION_TEN_STRING            #language en-US  "F10=Save"
                                       #language fr-FR  "F10=Économiser"
#string ENTER_STRING                   #language en-US  "<Enter>=Select Entry"
                                       #language fr-FR  "<Enter>=Choisir l'Entrée"
#string ENTER_COMMIT_STRING            #language en-US  "<Enter>=Complete Entry"
                                       #language fr-FR  "<Enter>=Compléter l'Entrée"
#string ENTER_ESCAPE_STRING            #language en-US  "Esc=Exit Entry"
                                       #language fr-FR  "Esc=Sortir l'Entrée"
#string ESCAPE_STRING                  #language en-US  "Esc=Exit"
                                       #language fr-FR  "Esc=Sortir"
#string SAVE_FAILED                    #language en-US  "Failed to Save"
                                       #language fr-FR  "Échouer à économiser"
#string ADJUST_HELP_PAGE_DOWN          #language en-US  "More (D/d)"
                                       #language fr-FR  "More (D/d)"
#string ADJUST_HELP_PAGE_UP            #language en-US  "More (U/u)"
                                       #language fr-FR  "More (U/u)"
#string ADJUST_NUMBER                  #language en-US  "+/- =Adjust Value"
                                       #language fr-FR  "+/- =Ajuster la valeur"
#string PLUS_STRING                    #language en-US  "+ =Move Selection Up"
                                       #language fr-FR  "+ =Relever le choix"
#string MINUS_STRING                   #language en-US  "- =Move Selection Down"
                                       #language fr-FR  "- =Abaisser le choix"
#string MOVE_HIGHLIGHT                 #language en-US  "=Move Highlight"
                                       #language fr-FR  "=Essentiel de mouvement"
#string MAKE_SELECTION                 #language en-US  " =Select From Choices"
                                       #language fr-FR  " =Choisir des Choix"
#string DEC_NUMERIC_INPUT              #language en-US  "0123456789 are valid inputs"
                                       #language fr-FR  "0123456789 sont des données valides"
#string HEX_NUMERIC_INPUT              #language en-US  "0-9 a-f are valid inputs"
                                       #language fr-FR  "0-9 a-f sont des données valides"
#string TOGGLE_CHECK_BOX               #language en-US  "<Spacebar>Toggle Checkbox"
                                       #language fr-FR  "<Spacebar>Bascule la Case de pointage"
#string PROMPT_FOR_PASSWORD            #language en-US  "Please type in password"
                                       #language fr-FR  "S'il vous plaît tape votre mot de passe"
#string PROMPT_FOR_NEW_PASSWORD        #language en-US  "Please type in new password"
                                       #language fr-FR  "S'il vous plaît tape votre nouveau mot de passe"
#string CONFIRM_PASSWORD               #language en-US  "Please confirm new password"
                                       #language fr-FR  "S'il vous plaît confirmer votre nouveau mot de passe"
#string CONFIRM_ERROR                  #language en-US  "Passwords are not the same"
                                       #language fr-FR  "Les mots de passe ne sont pas pareils"
#string PASSWORD_INVALID               #language en-US  "Incorrect password"
                                       #language fr-FR  "Mauvais mot de passe"
#string PRESS_ENTER                    #language en-US  "Press ENTER to continue"
                                       #language fr-FR  "La presse ENTRE continuer"
#string PROMPT_FOR_DATA                #language en-US  "Please type in your data"
                                       #language fr-FR  "S'il vous plaît tape vos données"
#string NV_UPDATE_MESSAGE              #language en-US  "NV"
                                       #language fr-FR  "NV"
#string INPUT_ERROR_MESSAGE            #language en-US  "!!"
                                       #language fr-FR  "!!"
#string EMPTY_STRING                   #language en-US  ""
                                       #language fr-FR  ""
#string ARE_YOU_SURE_YES               #language en-US  "Y"
                                       #language fr-FR  "Y"
#string ARE_YOU_SURE_NO                #language en-US  "N"
                                       #language fr-FR  "N"
#string MINI_STRING                    #language en-US  "Please enter enough characters"
                                       #language fr-FR  "Veuillez écrire assez de caractères"
#string SAVE_CHANGES                   #language en-US  "Changes have not saved. Save Changes and exit?"
                                       #language fr-FR  "Enregistrer les modifications et quitter?"
#string ARE_YOU_SURE                   #language en-US  "Press 'Y' to save and exit, 'N' to discard and exit, 'ESC' to cancel."
                                       #language fr-FR  "Pressez 'Y' pour sauvegarder et quitter, 'N' de se défaire et de sortie"
#string OPTION_MISMATCH                #language en-US  "Question value mismatch with Option value!"
                                       #language fr-FR  "Question valeur décalage avec l'option valeur!"
#string FORM_SUPPRESSED                #language en-US  "Form is suppressed. Nothing is displayed."
                                       #language fr-FR  "Form is suppressed. Nothing is displayed."
#string CHANGE_REMINDER                #language en-US  "Changes have not saved. Save Changes or not?"
                                       #language fr-FR  "Changes have not saved. Save Changes or not?"
#string SAVE_CONFIRM                   #language en-US  "Press 'Y' to save and exit, 'N' to discard and exit."
                                       #language fr-FR  "Press 'Y' to save and exit, 'N' to discard and exit."
#string DISCARD_FAILED                 #language en-US  "Failed to Discard"
                                       #language fr-FR  "Failed to Discard"
#string DEFAULT_FAILED                 #language en-US  "Failed to Default Setting"
                                       #language fr-FR  "Failed to Default Setting"

#string BYO_SOFT_FLAG                  #language en-US  "Byosoft BIOS Setup Utility"
#string HOME_PAGE_TITLE                #language en-US  "Setup Interpreter"
                                       #language fr-FR  "Interprète d'organisation"
#string HOME_ESCAPE_STRING             #language en-US  "Esc=Exit Interpreter"
                                       #language fr-FR  "Esc=l'Interprète de sortie"
#string FUNCTION_ONE_STRING            #language en-US  "Help"
#string FUNCTION_ONE_NAME              #language en-US  "F1"
#string FUNCTION_TWO_STRING            #language en-US  "F2=Previous Page"
                                       #language fr-FR  "F2=Previous Page"
#string STR_RESULT_SUCCESS             #language en-US  "Success!"
#string STR_RESULT_FAILED              #language en-US  "Failed!"
#string ARE_YOU_SURE                   #language en-US  "Are you sure?"
                                       #language fr-FR  "Êtes-vous sûr? (Y/N)"
#string STRING_ARROWUP_DOWN            #language en-US  "Select Item"
#string PLUS_MINUS_STRING              #language en-US  "-/+"
#string STRING_CHANGE_VALUES           #language en-US  "Change Value"
#string STRING_FUNCTION_NINE           #language en-US  "F9"
#string STRING_SETUP_DEFAULT           #language en-US  "Restore Default"
#string STRING_ESC                     #language en-US  "Esc"
#string STRING_ESC_STRING              #language en-US  "Exit"
#string STRING_SELECT_MENU             #language en-US  "Move Menu"
#string STRING_ENTER                   #language en-US  "Enter"
#string STRING_FUNCTION_TEN            #language en-US  "F10"
#string STRING_SAVE_AND_EXIT           #language en-US  "Save & Exit"
#string STRING_HELP_MESSAGE            #language en-US  "Help Message"

#string ARE_YOU_SURE_EXIT              #language en-US  "Exit now?"
#string ARE_YOU_SURE_EXIT_WITHSAVING   #language en-US  "Save Changes and Exit now?"
#string ARE_YOU_SURE_SAVING_CHANGES   #language en-US  "Save Changes now?"
#string ARE_YOU_SURE_EXIT_WITHOUTSAVING    #language en-US "Discard Changes and Exit now?"
#string ARE_YOU_SURE_DISCARD    #language en-US "Discard Changes now?"
#string ARE_YOU_SURE_SAVE_USER_DEFAULT    #language en-US "Save as User Default?"
#string ARE_YOU_SURE_LOAD_USER_DEFAULT    #language en-US "Restore User Default?"
#string ARE_YOU_SURE_LOAD_DEFAULT      #language en-US  "Are you sure load defaults?"

#string STR_SETUP_CONFIRMATION         #language en-US  "Setup Confirmation"
#string STRING_POWERON_PASSWORD        #language en-US  "Set Power-On Password"
#string STRING_SETUP_NOTICE            #language en-US  "Setup Notice"
#string STRING_CONFIRM_SUCCESS         #language en-US  "Changes have been saved."
#string STRING_GENERAL_HELP            #language en-US  "General Help"
#string STRING_TAB_KEY                 #language en-US  "Tab"
#string STRING_BOOT_MENU_PROMPT        #language en-US  "Please select boot device:"
#string STRING_BOOT_MENU_HELP_1        #language en-US  " to move selection"
#string STRING_BOOT_MENU_HELP_2        #language en-US  "ENTER to select boot device"
#string STRING_BOOT_MENU_HELP_3        #language en-US  "ESC to exit and then enter system"
#string STRING_GENERAL_HELP1            #language en-US  "F1  Help             -/+   Change Value"
#string STRING_GENERAL_HELP2            #language en-US  "F9  Restore Default  Enter Enter Sub Menu"
#string STRING_GENERAL_HELP3            #language en-US  "F10 Save & Exit      Esc   Exit"

#string DISCARD_FAILED                 #language en-US  "Failed to Discard"
                                       #language fr-FR  "Failed to Discard"
#string DEFAULT_FAILED                 #language en-US  "Failed to Default Setting"
                                       #language fr-FR  "Failed to Default Setting"
